// Вивести числа від 20 до 30 через пропуск, використовуючи крок 0,5 (20 20,5 21 21,5….).
let str = '';
for (let i = 20; i <= 30; i=i+0.5) {
 str += i + ' ';
 }
   console.log(str.trim());


// Один долар коштує 27 гривень. Вивести дані з розрахунком вартості 10, 20, 30... 100 доларів.

let $ = 27;
for(let i = 10; i<=100; i = i + 10){
 console.log($*i)
}


// Дане ціле число. Вивести всі цілі числа від 1 до 100, квадрат яких не перевищує числа N.


let i = 1;
let n = 200;
while(i ** 2 <= n) {
console.log(i);
i++;
}

// Дане ціле число. З'ясувати, чи є воно простим (простим називається число, більше 1, які не мають інших дільників крім 1 і себе).

// ////////К сожелению я не смог решить вот эту и нижню задачи,бо я не понимаю логики как это доллжно быть,иожешь снимать балы тока если можно покажи как оно должно быть////




// Дане деяке число. Визначити, чи можна одержати це число шляхом зведення числа 3 у деякий ступінь. (Наприклад, числа 9, 81 можна отримати, а 13 - не можна)

