// // Вивести на сторінку в один рядок через кому числа від 10 до 20.

let arr = [];
for (let i = 10; i <= 20; i++) {
  arr.push(i);
}
console.log(String(arr));

// // Вивести квадрати чисел від 10 до 20.
// (знаю тебе не понравится название 'sum'я его использую во многих тут задачках,но пока фантазия не сильно с названием работает,но буду исправлятся)

let  sum8 = 0;
for ( let i = 10; i <=20; i++) {
  sum8 = i*i;
  console.log(sum8)
}


// Вивести таблицю множення на 7.


for (let i = 1; i <=10; i++) {
  console.log(i * 7)
}  


// Знайти суму всіх цілих чисел від 1 до 15.

  
    for(let i = 1; i<=15; i++){
        console.log(i + 15)
    }

// Знайти добуток усіх цілих чисел від 15 до 35.


   
    for(let i = 15; i<=35; i++){
        console.log(i * 35)
      }

// Знайти середнє арифметичне всіх цілих чисел від 1 до 500.

// (Честно говоря я не сильно разобрлся как это реализовать,перездовать больше не буду ,но если можно напиши как должно быть для общего понимания)
      
          for(let i = 1; i<500; i++){
            i += i;
              console.log(i / 2)
          }
// Вивести суму лише парних чисел в діапазоні від 30 до 80.

   for(let i = 30; i<=80; i++){
    console.log(i + 80)
    
}
// Вивести всі числа в діапазоні від 100 до 200 кратні 3.

   let sum4=0; 

   for(let i=100; i<200; i++){
    if (i % 3 === 0){
        sum4 += i
        console.log(sum4)
    }
 }

// //  Дано натуральне число. Знайти та вивести на сторінку всі його дільники.

    let a = 10;
    for (let i = 0; i < a; i++) {
    if (a % i == 0)
    console.log('');
    }




// // Визначити кількість його парних дільників.

    let b = 10;
    for (let i = 0; i < b; i++) {
    if (b % i == 0 && i % 2 == 0)
    console.log(b);
    }




// Знайти суму його парних дільників.
let c = 10;
let sum7 = 0;
for (let i = 0; i < c; i++) {
if (c % i == 0 && i % 2 == 0){
    sum7 = c + i;
}

console.log(sum7);
}




// // Надрукувати повну таблицю множення від 1 до 10.

let sum5 = '';
for (let i = 1; i <10; i++) {
    for (let j = 1; j <10; j++) {
        sum5 += (j*i) + '  ';       
    }
console.log(i + " x");
console.log(sum5);
    sum5= '';
} 